# MepZoneEquipmentBehavior Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepZoneEquipmentBehavior Property
ParameterTypeId Class See Also
---
"Behavior"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepZoneEquipmentBehavior { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepZoneEquipmentBehavior As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepZoneEquipmentBehavior {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace